<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7774070e9c9d14d58ccc6f1b1cd462e98e244f90b51dd853d70abb8ca734b8ac","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #940 at https://github.com/cal-itp/data-infra/actions/runs/19152039838","plan_out_hash":"35be6c0f91ed41439d25ce770351cc8f805f27e10f13b5fc4b183e3e73c34929","plan_hash":"0c47c852ac00526bc1f14a0dc8e7ae90d9e7eb734ad545d4c25023c8c5841b87","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/operators/scrape_ntd_xlsx.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "eyh8Kg==" -> (known after apply)
!~      detect_md5hash      = "5LhFUUA28DGfbTgC3px13Q==" -> "different hash"
!~      generation          = 1757439213776362 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/scrape_ntd_xlsx.py"
!~      md5hash             = "5LhFUUA28DGfbTgC3px13Q==" -> (known after apply)
        name                = "plugins/operators/scrape_ntd_xlsx.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #940](https://github.com/cal-itp/data-infra/actions/runs/19152039838)